mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2g2xh/common/s6e2g2xh.h
typedef struct stc_ethernet_mac_riwtr_field
{
    union {
        struct {
            __IO  uint32_t  RIWT                 :8;
            __IO  uint32_t  RESERVED0            :24;
        };
        struct {
            __IO  uint32_t  RIWT0                :1;
            __IO  uint32_t  RIWT1                :1;
            __IO  uint32_t  RIWT2                :1;
            __IO  uint32_t  RIWT3                :1;
            __IO  uint32_t  RIWT4                :1;
            __IO  uint32_t  RIWT5                :1;
            __IO  uint32_t  RIWT6                :1;
            __IO  uint32_t  RIWT7                :1;
            __IO  uint32_t  RESERVED1            :24;
        };
    };
} stc_ethernet_mac_riwtr_field_t;

typedef struct stc_ethernet_mac_ahbsr_field
{
        __IO  uint32_t  AHBS                     :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_ethernet_mac_ahbsr_field_t;

typedef struct stc_ethernet_mac_chtdr_field
{
    union {
        struct {
            __IO  uint32_t  HTDAP                :32;
        };
        struct {
            __IO  uint32_t  HTDAP0               :1;
            __IO  uint32_t  HTDAP1               :1;
            __IO  uint32_t  HTDAP2               :1;
            __IO  uint32_t  HTDAP3               :1;
            __IO  uint32_t  HTDAP4               :1;
            __IO  uint32_t  HTDAP5               :1;
            __IO  uint32_t  HTDAP6               :1;
            __IO  uint32_t  HTDAP7               :1;
            __IO  uint32_t  HTDAP8               :1;
            __IO  uint32_t  HTDAP9               :1;
            __IO  uint32_t  HTDAP10              :1;
            __IO  uint32_t  HTDAP11              :1;
            __IO  uint32_t  HTDAP12              :1;
            __IO  uint32_t  HTDAP13              :1;
            __IO  uint32_t  HTDAP14              :1;
            __IO  uint32_t  HTDAP15              :1;
            __IO  uint32_t  HTDAP16              :1;
            __IO  uint32_t  HTDAP17              :1;
            __IO  uint32_t  HTDAP18              :1;
            __IO  uint32_t  HTDAP19              :1;
            __IO  uint32_t  HTDAP20              :1;
            __IO  uint32_t  HTDAP21              :1;
            __IO  uint32_t  HTDAP22              :1;
            __IO  uint32_t  HTDAP23              :1;
            __IO  uint32_t  HTDAP24              :1;
            __IO  uint32_t  HTDAP25              :1;
            __IO  uint32_t  HTDAP26              :1;
            __IO  uint32_t  HTDAP27              :1;
            __IO  uint32_t  HTDAP28              :1;
            __IO  uint32_t  HTDAP29              :1;
            __IO  uint32_t  HTDAP30              :1;
            __IO  uint32_t  HTDAP31              :1;
        };
    };
} stc_ethernet_mac_chtdr_field_t;

typedef struct stc_ethernet_mac_chrdr_field
{
    union {
        struct {
            __IO  uint32_t  HRDAP                :32;
        };
        struct {
            __IO  uint32_t  HRDAP0               :1;
            __IO  uint32_t  HRDAP1               :1;
            __IO  uint32_t  HRDAP2               :1;
            __IO  uint32_t  HRDAP3               :1;
            __IO  uint32_t  HRDAP4               :1;
            __IO  uint32_t  HRDAP5               :1;
            __IO  uint32_t  HRDAP6               :1;
            __IO  uint32_t  HRDAP7               :1;
            __IO  uint32_t  HRDAP8               :1;
            __IO  uint32_t  HRDAP9               :1;
            __IO  uint32_t  HRDAP10              :1;
            __IO  uint32_t  HRDAP11              :1;
            __IO  uint32_t  HRDAP12              :1;
            __IO  uint32_t  HRDAP13              :1;
            __IO  uint32_t  HRDAP14              :1;
            __IO  uint32_t  HRDAP15              :1;
            __IO  uint32_t  HRDAP16              :1;
            __IO  uint32_t  HRDAP17              :1;
            __IO  uint32_t  HRDAP18              :1;
            __IO  uint32_t  HRDAP19              :1;
            __IO  uint32_t  HRDAP20              :1;
            __IO  uint32_t  HRDAP21              :1;
            __IO  uint32_t  HRDAP22              :1;
            __IO  uint32_t  HRDAP23              :1;
            __IO  uint32_t  HRDAP24              :1;
            __IO  uint32_t  HRDAP25              :1;
            __IO  uint32_t  HRDAP26              :1;
            __IO  uint32_t  HRDAP27              :1;
            __IO  uint32_t  HRDAP28              :1;
            __IO  uint32_t  HRDAP29              :1;
            __IO  uint32_t  HRDAP30              :1;
            __IO  uint32_t  HRDAP31              :1;
        };
    };
} stc_ethernet_mac_chrdr_field_t;

typedef struct stc_ethernet_mac_chtbar_field
{
    union {
        struct {
            __IO  uint32_t  HTBAR                :32;
        };
        struct {
            __IO  uint32_t  HTBAR0               :1;
            __IO  uint32_t  HTBAR1               :1;
            __IO  uint32_t  HTBAR2               :1;
            __IO  uint32_t  HTBAR3               :1;
            __IO  uint32_t  HTBAR4               :1;
            __IO  uint32_t  HTBAR5               :1;
            __IO  uint32_t  HTBAR6               :1;
            __IO  uint32_t  HTBAR7               :1;
            __IO  uint32_t  HTBAR8               :1;
            __IO  uint32_t  HTBAR9               :1;
            __IO  uint32_t  HTBAR10              :1;
            __IO  uint32_t  HTBAR11              :1;
            __IO  uint32_t  HTBAR12              :1;
            __IO  uint32_t  HTBAR13              :1;
            __IO  uint32_t  HTBAR14              :1;
            __IO  uint32_t  HTBAR15              :1;
            __IO  uint32_t  HTBAR16              :1;
            __IO  uint32_t  HTBAR17              :1;
            __IO  uint32_t  HTBAR18              :1;
            __IO  uint32_t  HTBAR19              :1;
            __IO  uint32_t  HTBAR20              :1;
            __IO  uint32_t  HTBAR21              :1;
            __IO  uint32_t  HTBAR22              :1;
            __IO  uint32_t  HTBAR23              :1;
            __IO  uint32_t  HTBAR24              :1;
            __IO  uint32_t  HTBAR25              :1;
            __IO  uint32_t  HTBAR26              :1;
            __IO  uint32_t  HTBAR27              :1;
            __IO  uint32_t  HTBAR28              :1;
            __IO  uint32_t  HTBAR29              :1;
            __IO  uint32_t  HTBAR30              :1;
            __IO  uint32_t  HTBAR31              :1;
        };
    };
} stc_ethernet_mac_chtbar_field_t;

