mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2g2xh/common/s6e2g2xh.h
#define bFM_ETHERNET_MAC0_IMR_RGIM                *((volatile  uint8_t *)(0x42C80780UL))
#define bFM4_ETHERNET_MAC0_IMR_RGIM               *((volatile  uint8_t *)(0x42C80780UL))
#define bFM_ETHERNET_MAC0_IMR_PIM                 *((volatile  uint8_t *)(0x42C8078CUL))
#define bFM4_ETHERNET_MAC0_IMR_PIM                *((volatile  uint8_t *)(0x42C8078CUL))
#define bFM_ETHERNET_MAC0_IMR_TSIM                *((volatile  uint8_t *)(0x42C807A4UL))
#define bFM4_ETHERNET_MAC0_IMR_TSIM               *((volatile  uint8_t *)(0x42C807A4UL))
#define bFM_ETHERNET_MAC0_IMR_LPIIM               *((volatile  uint8_t *)(0x42C807A8UL))
#define bFM4_ETHERNET_MAC0_IMR_LPIIM              *((volatile  uint8_t *)(0x42C807A8UL))

#define bFM_ETHERNET_MAC0_ISR_RGIS                *((volatile  uint8_t *)(0x42C80700UL))
#define bFM4_ETHERNET_MAC0_ISR_RGIS               *((volatile  uint8_t *)(0x42C80700UL))
#define bFM_ETHERNET_MAC0_ISR_PIS                 *((volatile  uint8_t *)(0x42C8070CUL))
#define bFM4_ETHERNET_MAC0_ISR_PIS                *((volatile  uint8_t *)(0x42C8070CUL))
#define bFM_ETHERNET_MAC0_ISR_MIS                 *((volatile  uint8_t *)(0x42C80710UL))
#define bFM4_ETHERNET_MAC0_ISR_MIS                *((volatile  uint8_t *)(0x42C80710UL))
#define bFM_ETHERNET_MAC0_ISR_RIS                 *((volatile  uint8_t *)(0x42C80714UL))
#define bFM4_ETHERNET_MAC0_ISR_RIS                *((volatile  uint8_t *)(0x42C80714UL))
#define bFM_ETHERNET_MAC0_ISR_TIS                 *((volatile  uint8_t *)(0x42C80718UL))
#define bFM4_ETHERNET_MAC0_ISR_TIS                *((volatile  uint8_t *)(0x42C80718UL))
#define bFM_ETHERNET_MAC0_ISR_COIS                *((volatile  uint8_t *)(0x42C8071CUL))
#define bFM4_ETHERNET_MAC0_ISR_COIS               *((volatile  uint8_t *)(0x42C8071CUL))
#define bFM_ETHERNET_MAC0_ISR_TSIS                *((volatile  uint8_t *)(0x42C80724UL))
#define bFM4_ETHERNET_MAC0_ISR_TSIS               *((volatile  uint8_t *)(0x42C80724UL))
#define bFM_ETHERNET_MAC0_ISR_LPIIS               *((volatile  uint8_t *)(0x42C80728UL))
#define bFM4_ETHERNET_MAC0_ISR_LPIIS              *((volatile  uint8_t *)(0x42C80728UL))

#define bFM_ETHERNET_MAC0_LPICSR_TLPIEN           *((volatile  uint8_t *)(0x42C80600UL))
#define bFM4_ETHERNET_MAC0_LPICSR_TLPIEN          *((volatile  uint8_t *)(0x42C80600UL))
#define bFM_ETHERNET_MAC0_LPICSR_TLPIEX           *((volatile  uint8_t *)(0x42C80604UL))
#define bFM4_ETHERNET_MAC0_LPICSR_TLPIEX          *((volatile  uint8_t *)(0x42C80604UL))
#define bFM_ETHERNET_MAC0_LPICSR_RLPIEN           *((volatile  uint8_t *)(0x42C80608UL))
#define bFM4_ETHERNET_MAC0_LPICSR_RLPIEN          *((volatile  uint8_t *)(0x42C80608UL))
#define bFM_ETHERNET_MAC0_LPICSR_RLPIEX           *((volatile  uint8_t *)(0x42C8060CUL))
#define bFM4_ETHERNET_MAC0_LPICSR_RLPIEX          *((volatile  uint8_t *)(0x42C8060CUL))
#define bFM_ETHERNET_MAC0_LPICSR_TLPIST           *((volatile  uint8_t *)(0x42C80620UL))
#define bFM4_ETHERNET_MAC0_LPICSR_TLPIST          *((volatile  uint8_t *)(0x42C80620UL))
#define bFM_ETHERNET_MAC0_LPICSR_RLPIST           *((volatile  uint8_t *)(0x42C80624UL))
#define bFM4_ETHERNET_MAC0_LPICSR_RLPIST          *((volatile  uint8_t *)(0x42C80624UL))
#define bFM_ETHERNET_MAC0_LPICSR_LPIEN            *((volatile  uint8_t *)(0x42C80640UL))
#define bFM4_ETHERNET_MAC0_LPICSR_LPIEN           *((volatile  uint8_t *)(0x42C80640UL))
#define bFM_ETHERNET_MAC0_LPICSR_PLS              *((volatile  uint8_t *)(0x42C80644UL))
#define bFM4_ETHERNET_MAC0_LPICSR_PLS             *((volatile  uint8_t *)(0x42C80644UL))
#define bFM_ETHERNET_MAC0_LPICSR_PLSEN            *((volatile  uint8_t *)(0x42C80648UL))
#define bFM4_ETHERNET_MAC0_LPICSR_PLSEN           *((volatile  uint8_t *)(0x42C80648UL))
#define bFM_ETHERNET_MAC0_LPICSR_LPITXA           *((volatile  uint8_t *)(0x42C8064CUL))
#define bFM4_ETHERNET_MAC0_LPICSR_LPITXA          *((volatile  uint8_t *)(0x42C8064CUL))

#define bFM_ETHERNET_MAC0_MAR0H_MO                *((volatile  uint8_t *)(0x42C8087CUL))
#define bFM4_ETHERNET_MAC0_MAR0H_MO               *((volatile  uint8_t *)(0x42C8087CUL))

#define bFM_ETHERNET_MAC0_MAR10H_SA               *((volatile  uint8_t *)(0x42C81278UL))
#define bFM4_ETHERNET_MAC0_MAR10H_SA              *((volatile  uint8_t *)(0x42C81278UL))
#define bFM_ETHERNET_MAC0_MAR10H_AE               *((volatile  uint8_t *)(0x42C8127CUL))
#define bFM4_ETHERNET_MAC0_MAR10H_AE              *((volatile  uint8_t *)(0x42C8127CUL))

#define bFM_ETHERNET_MAC0_MAR11H_SA               *((volatile  uint8_t *)(0x42C81378UL))
#define bFM4_ETHERNET_MAC0_MAR11H_SA              *((volatile  uint8_t *)(0x42C81378UL))
#define bFM_ETHERNET_MAC0_MAR11H_AE               *((volatile  uint8_t *)(0x42C8137CUL))
#define bFM4_ETHERNET_MAC0_MAR11H_AE              *((volatile  uint8_t *)(0x42C8137CUL))

#define bFM_ETHERNET_MAC0_MAR12H_SA               *((volatile  uint8_t *)(0x42C81478UL))
#define bFM4_ETHERNET_MAC0_MAR12H_SA              *((volatile  uint8_t *)(0x42C81478UL))
#define bFM_ETHERNET_MAC0_MAR12H_AE               *((volatile  uint8_t *)(0x42C8147CUL))
#define bFM4_ETHERNET_MAC0_MAR12H_AE              *((volatile  uint8_t *)(0x42C8147CUL))

#define bFM_ETHERNET_MAC0_MAR13H_SA               *((volatile  uint8_t *)(0x42C81578UL))
#define bFM4_ETHERNET_MAC0_MAR13H_SA              *((volatile  uint8_t *)(0x42C81578UL))
#define bFM_ETHERNET_MAC0_MAR13H_AE               *((volatile  uint8_t *)(0x42C8157CUL))
#define bFM4_ETHERNET_MAC0_MAR13H_AE              *((volatile  uint8_t *)(0x42C8157CUL))

#define bFM_ETHERNET_MAC0_MAR14H_SA               *((volatile  uint8_t *)(0x42C81678UL))
#define bFM4_ETHERNET_MAC0_MAR14H_SA              *((volatile  uint8_t *)(0x42C81678UL))
#define bFM_ETHERNET_MAC0_MAR14H_AE               *((volatile  uint8_t *)(0x42C8167CUL))
#define bFM4_ETHERNET_MAC0_MAR14H_AE              *((volatile  uint8_t *)(0x42C8167CUL))

#define bFM_ETHERNET_MAC0_MAR15H_SA               *((volatile  uint8_t *)(0x42C81778UL))
#define bFM4_ETHERNET_MAC0_MAR15H_SA              *((volatile  uint8_t *)(0x42C81778UL))
#define bFM_ETHERNET_MAC0_MAR15H_AE               *((volatile  uint8_t *)(0x42C8177CUL))
#define bFM4_ETHERNET_MAC0_MAR15H_AE              *((volatile  uint8_t *)(0x42C8177CUL))

#define bFM_ETHERNET_MAC0_MAR16H_SA               *((volatile  uint8_t *)(0x42C90078UL))
#define bFM4_ETHERNET_MAC0_MAR16H_SA              *((volatile  uint8_t *)(0x42C90078UL))
#define bFM_ETHERNET_MAC0_MAR16H_AE               *((volatile  uint8_t *)(0x42C9007CUL))
#define bFM4_ETHERNET_MAC0_MAR16H_AE              *((volatile  uint8_t *)(0x42C9007CUL))

#define bFM_ETHERNET_MAC0_MAR17H_SA               *((volatile  uint8_t *)(0x42C90178UL))
#define bFM4_ETHERNET_MAC0_MAR17H_SA              *((volatile  uint8_t *)(0x42C90178UL))
#define bFM_ETHERNET_MAC0_MAR17H_AE               *((volatile  uint8_t *)(0x42C9017CUL))
#define bFM4_ETHERNET_MAC0_MAR17H_AE              *((volatile  uint8_t *)(0x42C9017CUL))

