mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2g2xh/common/s6e2g2xh.h
#define bFM_GPIO_DDR4_P0                          *((volatile  uint8_t *)(0x42DE4200UL))
#define bFM4_GPIO_DDR4_P0                         *((volatile  uint8_t *)(0x42DE4200UL))
#define bFM_GPIO_DDR4_P1                          *((volatile  uint8_t *)(0x42DE4204UL))
#define bFM4_GPIO_DDR4_P1                         *((volatile  uint8_t *)(0x42DE4204UL))
#define bFM_GPIO_DDR4_P2                          *((volatile  uint8_t *)(0x42DE4208UL))
#define bFM4_GPIO_DDR4_P2                         *((volatile  uint8_t *)(0x42DE4208UL))
#define bFM_GPIO_DDR4_P3                          *((volatile  uint8_t *)(0x42DE420CUL))
#define bFM4_GPIO_DDR4_P3                         *((volatile  uint8_t *)(0x42DE420CUL))
#define bFM_GPIO_DDR4_P4                          *((volatile  uint8_t *)(0x42DE4210UL))
#define bFM4_GPIO_DDR4_P4                         *((volatile  uint8_t *)(0x42DE4210UL))
#define bFM_GPIO_DDR4_P5                          *((volatile  uint8_t *)(0x42DE4214UL))
#define bFM4_GPIO_DDR4_P5                         *((volatile  uint8_t *)(0x42DE4214UL))
#define bFM_GPIO_DDR4_P6                          *((volatile  uint8_t *)(0x42DE4218UL))
#define bFM4_GPIO_DDR4_P6                         *((volatile  uint8_t *)(0x42DE4218UL))
#define bFM_GPIO_DDR4_P7                          *((volatile  uint8_t *)(0x42DE421CUL))
#define bFM4_GPIO_DDR4_P7                         *((volatile  uint8_t *)(0x42DE421CUL))
#define bFM_GPIO_DDR4_P8                          *((volatile  uint8_t *)(0x42DE4220UL))
#define bFM4_GPIO_DDR4_P8                         *((volatile  uint8_t *)(0x42DE4220UL))
#define bFM_GPIO_DDR4_P9                          *((volatile  uint8_t *)(0x42DE4224UL))
#define bFM4_GPIO_DDR4_P9                         *((volatile  uint8_t *)(0x42DE4224UL))
#define bFM_GPIO_DDR4_PA                          *((volatile  uint8_t *)(0x42DE4228UL))
#define bFM4_GPIO_DDR4_PA                         *((volatile  uint8_t *)(0x42DE4228UL))
#define bFM_GPIO_DDR4_PB                          *((volatile  uint8_t *)(0x42DE422CUL))
#define bFM4_GPIO_DDR4_PB                         *((volatile  uint8_t *)(0x42DE422CUL))
#define bFM_GPIO_DDR4_PC                          *((volatile  uint8_t *)(0x42DE4230UL))
#define bFM4_GPIO_DDR4_PC                         *((volatile  uint8_t *)(0x42DE4230UL))
#define bFM_GPIO_DDR4_PD                          *((volatile  uint8_t *)(0x42DE4234UL))
#define bFM4_GPIO_DDR4_PD                         *((volatile  uint8_t *)(0x42DE4234UL))
#define bFM_GPIO_DDR4_PE                          *((volatile  uint8_t *)(0x42DE4238UL))
#define bFM4_GPIO_DDR4_PE                         *((volatile  uint8_t *)(0x42DE4238UL))

#define bFM_GPIO_DDR6_P0                          *((volatile  uint8_t *)(0x42DE4300UL))
#define bFM4_GPIO_DDR6_P0                         *((volatile  uint8_t *)(0x42DE4300UL))
#define bFM_GPIO_DDR6_P1                          *((volatile  uint8_t *)(0x42DE4304UL))
#define bFM4_GPIO_DDR6_P1                         *((volatile  uint8_t *)(0x42DE4304UL))
#define bFM_GPIO_DDR6_P2                          *((volatile  uint8_t *)(0x42DE4308UL))
#define bFM4_GPIO_DDR6_P2                         *((volatile  uint8_t *)(0x42DE4308UL))
#define bFM_GPIO_DDR6_P3                          *((volatile  uint8_t *)(0x42DE430CUL))
#define bFM4_GPIO_DDR6_P3                         *((volatile  uint8_t *)(0x42DE430CUL))
#define bFM_GPIO_DDR6_PE                          *((volatile  uint8_t *)(0x42DE4338UL))
#define bFM4_GPIO_DDR6_PE                         *((volatile  uint8_t *)(0x42DE4338UL))

#define bFM_GPIO_DDR7_P0                          *((volatile  uint8_t *)(0x42DE4380UL))
#define bFM4_GPIO_DDR7_P0                         *((volatile  uint8_t *)(0x42DE4380UL))
#define bFM_GPIO_DDR7_P1                          *((volatile  uint8_t *)(0x42DE4384UL))
#define bFM4_GPIO_DDR7_P1                         *((volatile  uint8_t *)(0x42DE4384UL))
#define bFM_GPIO_DDR7_P2                          *((volatile  uint8_t *)(0x42DE4388UL))
#define bFM4_GPIO_DDR7_P2                         *((volatile  uint8_t *)(0x42DE4388UL))
#define bFM_GPIO_DDR7_P3                          *((volatile  uint8_t *)(0x42DE438CUL))
#define bFM4_GPIO_DDR7_P3                         *((volatile  uint8_t *)(0x42DE438CUL))
#define bFM_GPIO_DDR7_P4                          *((volatile  uint8_t *)(0x42DE4390UL))
#define bFM4_GPIO_DDR7_P4                         *((volatile  uint8_t *)(0x42DE4390UL))
#define bFM_GPIO_DDR7_P5                          *((volatile  uint8_t *)(0x42DE4394UL))
#define bFM4_GPIO_DDR7_P5                         *((volatile  uint8_t *)(0x42DE4394UL))
#define bFM_GPIO_DDR7_P6                          *((volatile  uint8_t *)(0x42DE4398UL))
#define bFM4_GPIO_DDR7_P6                         *((volatile  uint8_t *)(0x42DE4398UL))
#define bFM_GPIO_DDR7_P7                          *((volatile  uint8_t *)(0x42DE439CUL))
#define bFM4_GPIO_DDR7_P7                         *((volatile  uint8_t *)(0x42DE439CUL))
#define bFM_GPIO_DDR7_P8                          *((volatile  uint8_t *)(0x42DE43A0UL))
#define bFM4_GPIO_DDR7_P8                         *((volatile  uint8_t *)(0x42DE43A0UL))
#define bFM_GPIO_DDR7_P9                          *((volatile  uint8_t *)(0x42DE43A4UL))
#define bFM4_GPIO_DDR7_P9                         *((volatile  uint8_t *)(0x42DE43A4UL))
#define bFM_GPIO_DDR7_PA                          *((volatile  uint8_t *)(0x42DE43A8UL))
#define bFM4_GPIO_DDR7_PA                         *((volatile  uint8_t *)(0x42DE43A8UL))

#define bFM_GPIO_DDR8_P0                          *((volatile  uint8_t *)(0x42DE4400UL))
#define bFM4_GPIO_DDR8_P0                         *((volatile  uint8_t *)(0x42DE4400UL))
#define bFM_GPIO_DDR8_P1                          *((volatile  uint8_t *)(0x42DE4404UL))
#define bFM4_GPIO_DDR8_P1                         *((volatile  uint8_t *)(0x42DE4404UL))
#define bFM_GPIO_DDR8_P2                          *((volatile  uint8_t *)(0x42DE4408UL))
#define bFM4_GPIO_DDR8_P2                         *((volatile  uint8_t *)(0x42DE4408UL))
#define bFM_GPIO_DDR8_P3                          *((volatile  uint8_t *)(0x42DE440CUL))
#define bFM4_GPIO_DDR8_P3                         *((volatile  uint8_t *)(0x42DE440CUL))

#define bFM_GPIO_DDRA_P0                          *((volatile  uint8_t *)(0x42DE4500UL))
#define bFM4_GPIO_DDRA_P0                         *((volatile  uint8_t *)(0x42DE4500UL))
#define bFM_GPIO_DDRA_P1                          *((volatile  uint8_t *)(0x42DE4504UL))
#define bFM4_GPIO_DDRA_P1                         *((volatile  uint8_t *)(0x42DE4504UL))
#define bFM_GPIO_DDRA_P2                          *((volatile  uint8_t *)(0x42DE4508UL))
#define bFM4_GPIO_DDRA_P2                         *((volatile  uint8_t *)(0x42DE4508UL))
#define bFM_GPIO_DDRA_P3                          *((volatile  uint8_t *)(0x42DE450CUL))
#define bFM4_GPIO_DDRA_P3                         *((volatile  uint8_t *)(0x42DE450CUL))
#define bFM_GPIO_DDRA_P4                          *((volatile  uint8_t *)(0x42DE4510UL))
#define bFM4_GPIO_DDRA_P4                         *((volatile  uint8_t *)(0x42DE4510UL))
#define bFM_GPIO_DDRA_P5                          *((volatile  uint8_t *)(0x42DE4514UL))
#define bFM4_GPIO_DDRA_P5                         *((volatile  uint8_t *)(0x42DE4514UL))
#define bFM_GPIO_DDRA_P6                          *((volatile  uint8_t *)(0x42DE4518UL))
#define bFM4_GPIO_DDRA_P6                         *((volatile  uint8_t *)(0x42DE4518UL))
#define bFM_GPIO_DDRA_P7                          *((volatile  uint8_t *)(0x42DE451CUL))
#define bFM4_GPIO_DDRA_P7                         *((volatile  uint8_t *)(0x42DE451CUL))
#define bFM_GPIO_DDRA_P8                          *((volatile  uint8_t *)(0x42DE4520UL))
#define bFM4_GPIO_DDRA_P8                         *((volatile  uint8_t *)(0x42DE4520UL))
#define bFM_GPIO_DDRA_P9                          *((volatile  uint8_t *)(0x42DE4524UL))
#define bFM4_GPIO_DDRA_P9                         *((volatile  uint8_t *)(0x42DE4524UL))
#define bFM_GPIO_DDRA_PA                          *((volatile  uint8_t *)(0x42DE4528UL))
#define bFM4_GPIO_DDRA_PA                         *((volatile  uint8_t *)(0x42DE4528UL))
#define bFM_GPIO_DDRA_PB                          *((volatile  uint8_t *)(0x42DE452CUL))
#define bFM4_GPIO_DDRA_PB                         *((volatile  uint8_t *)(0x42DE452CUL))
#define bFM_GPIO_DDRA_PC                          *((volatile  uint8_t *)(0x42DE4530UL))
#define bFM4_GPIO_DDRA_PC                         *((volatile  uint8_t *)(0x42DE4530UL))
#define bFM_GPIO_DDRA_PD                          *((volatile  uint8_t *)(0x42DE4534UL))
#define bFM4_GPIO_DDRA_PD                         *((volatile  uint8_t *)(0x42DE4534UL))
#define bFM_GPIO_DDRA_PE                          *((volatile  uint8_t *)(0x42DE4538UL))
#define bFM4_GPIO_DDRA_PE                         *((volatile  uint8_t *)(0x42DE4538UL))
#define bFM_GPIO_DDRA_PF                          *((volatile  uint8_t *)(0x42DE453CUL))
#define bFM4_GPIO_DDRA_PF                         *((volatile  uint8_t *)(0x42DE453CUL))

