mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2g2xh/common/s6e2g2xh.h
#define bFM_MFS7_UART_ESCR_P                      *((volatile  uint8_t *)(0x4270E08CUL))
#define bFM4_MFS7_UART_ESCR_P                     *((volatile  uint8_t *)(0x4270E08CUL))
#define bFM_MFS7_UART_ESCR_PEN                    *((volatile  uint8_t *)(0x4270E090UL))
#define bFM4_MFS7_UART_ESCR_PEN                   *((volatile  uint8_t *)(0x4270E090UL))
#define bFM_MFS7_UART_ESCR_INV                    *((volatile  uint8_t *)(0x4270E094UL))
#define bFM4_MFS7_UART_ESCR_INV                   *((volatile  uint8_t *)(0x4270E094UL))
#define bFM_MFS7_UART_ESCR_ESBL                   *((volatile  uint8_t *)(0x4270E098UL))
#define bFM4_MFS7_UART_ESCR_ESBL                  *((volatile  uint8_t *)(0x4270E098UL))
#define bFM_MFS7_UART_ESCR_FLWEN                  *((volatile  uint8_t *)(0x4270E09CUL))
#define bFM4_MFS7_UART_ESCR_FLWEN                 *((volatile  uint8_t *)(0x4270E09CUL))

#define bFM_MFS7_UART_FCR_FE1                     *((volatile  uint8_t *)(0x4270E280UL))
#define bFM4_MFS7_UART_FCR_FE1                    *((volatile  uint8_t *)(0x4270E280UL))
#define bFM_MFS7_UART_FCR_FE2                     *((volatile  uint8_t *)(0x4270E284UL))
#define bFM4_MFS7_UART_FCR_FE2                    *((volatile  uint8_t *)(0x4270E284UL))
#define bFM_MFS7_UART_FCR_FCL1                    *((volatile  uint8_t *)(0x4270E288UL))
#define bFM4_MFS7_UART_FCR_FCL1                   *((volatile  uint8_t *)(0x4270E288UL))
#define bFM_MFS7_UART_FCR_FCL2                    *((volatile  uint8_t *)(0x4270E28CUL))
#define bFM4_MFS7_UART_FCR_FCL2                   *((volatile  uint8_t *)(0x4270E28CUL))
#define bFM_MFS7_UART_FCR_FSET                    *((volatile  uint8_t *)(0x4270E290UL))
#define bFM4_MFS7_UART_FCR_FSET                   *((volatile  uint8_t *)(0x4270E290UL))
#define bFM_MFS7_UART_FCR_FLD                     *((volatile  uint8_t *)(0x4270E294UL))
#define bFM4_MFS7_UART_FCR_FLD                    *((volatile  uint8_t *)(0x4270E294UL))
#define bFM_MFS7_UART_FCR_FLST                    *((volatile  uint8_t *)(0x4270E298UL))
#define bFM4_MFS7_UART_FCR_FLST                   *((volatile  uint8_t *)(0x4270E298UL))
#define bFM_MFS7_UART_FCR_FSEL                    *((volatile  uint8_t *)(0x4270E2A0UL))
#define bFM4_MFS7_UART_FCR_FSEL                   *((volatile  uint8_t *)(0x4270E2A0UL))
#define bFM_MFS7_UART_FCR_FTIE                    *((volatile  uint8_t *)(0x4270E2A4UL))
#define bFM4_MFS7_UART_FCR_FTIE                   *((volatile  uint8_t *)(0x4270E2A4UL))
#define bFM_MFS7_UART_FCR_FDRQ                    *((volatile  uint8_t *)(0x4270E2A8UL))
#define bFM4_MFS7_UART_FCR_FDRQ                   *((volatile  uint8_t *)(0x4270E2A8UL))
#define bFM_MFS7_UART_FCR_FRIIE                   *((volatile  uint8_t *)(0x4270E2ACUL))
#define bFM4_MFS7_UART_FCR_FRIIE                  *((volatile  uint8_t *)(0x4270E2ACUL))
#define bFM_MFS7_UART_FCR_FLSTE                   *((volatile  uint8_t *)(0x4270E2B0UL))
#define bFM4_MFS7_UART_FCR_FLSTE                  *((volatile  uint8_t *)(0x4270E2B0UL))

#define bFM_MFS7_UART_SCR_TXE                     *((volatile  uint8_t *)(0x4270E020UL))
#define bFM4_MFS7_UART_SCR_TXE                    *((volatile  uint8_t *)(0x4270E020UL))
#define bFM_MFS7_UART_SCR_RXE                     *((volatile  uint8_t *)(0x4270E024UL))
#define bFM4_MFS7_UART_SCR_RXE                    *((volatile  uint8_t *)(0x4270E024UL))
#define bFM_MFS7_UART_SCR_TBIE                    *((volatile  uint8_t *)(0x4270E028UL))
#define bFM4_MFS7_UART_SCR_TBIE                   *((volatile  uint8_t *)(0x4270E028UL))
#define bFM_MFS7_UART_SCR_TIE                     *((volatile  uint8_t *)(0x4270E02CUL))
#define bFM4_MFS7_UART_SCR_TIE                    *((volatile  uint8_t *)(0x4270E02CUL))
#define bFM_MFS7_UART_SCR_RIE                     *((volatile  uint8_t *)(0x4270E030UL))
#define bFM4_MFS7_UART_SCR_RIE                    *((volatile  uint8_t *)(0x4270E030UL))
#define bFM_MFS7_UART_SCR_UPCL                    *((volatile  uint8_t *)(0x4270E03CUL))
#define bFM4_MFS7_UART_SCR_UPCL                   *((volatile  uint8_t *)(0x4270E03CUL))

#define bFM_MFS7_UART_SMR_SOE                     *((volatile  uint8_t *)(0x4270E000UL))
#define bFM4_MFS7_UART_SMR_SOE                    *((volatile  uint8_t *)(0x4270E000UL))
#define bFM_MFS7_UART_SMR_BDS                     *((volatile  uint8_t *)(0x4270E008UL))
#define bFM4_MFS7_UART_SMR_BDS                    *((volatile  uint8_t *)(0x4270E008UL))
#define bFM_MFS7_UART_SMR_SBL                     *((volatile  uint8_t *)(0x4270E00CUL))
#define bFM4_MFS7_UART_SMR_SBL                    *((volatile  uint8_t *)(0x4270E00CUL))

#define bFM_MFS7_UART_SSR_TBI                     *((volatile  uint8_t *)(0x4270E0A0UL))
#define bFM4_MFS7_UART_SSR_TBI                    *((volatile  uint8_t *)(0x4270E0A0UL))
#define bFM_MFS7_UART_SSR_TDRE                    *((volatile  uint8_t *)(0x4270E0A4UL))
#define bFM4_MFS7_UART_SSR_TDRE                   *((volatile  uint8_t *)(0x4270E0A4UL))
#define bFM_MFS7_UART_SSR_RDRF                    *((volatile  uint8_t *)(0x4270E0A8UL))
#define bFM4_MFS7_UART_SSR_RDRF                   *((volatile  uint8_t *)(0x4270E0A8UL))
#define bFM_MFS7_UART_SSR_ORE                     *((volatile  uint8_t *)(0x4270E0ACUL))
#define bFM4_MFS7_UART_SSR_ORE                    *((volatile  uint8_t *)(0x4270E0ACUL))
#define bFM_MFS7_UART_SSR_FRE                     *((volatile  uint8_t *)(0x4270E0B0UL))
#define bFM4_MFS7_UART_SSR_FRE                    *((volatile  uint8_t *)(0x4270E0B0UL))
#define bFM_MFS7_UART_SSR_PE                      *((volatile  uint8_t *)(0x4270E0B4UL))
#define bFM4_MFS7_UART_SSR_PE                     *((volatile  uint8_t *)(0x4270E0B4UL))
#define bFM_MFS7_UART_SSR_REC                     *((volatile  uint8_t *)(0x4270E0BCUL))
#define bFM4_MFS7_UART_SSR_REC                    *((volatile  uint8_t *)(0x4270E0BCUL))


/*******************************************************************************
* MFS Registers MFS8
*   Bitband Section
*******************************************************************************/
#define bFM_MFS8_CSIO_ESCR_CSFE                   *((volatile  uint8_t *)(0x42710094UL))
#define bFM4_MFS8_CSIO_ESCR_CSFE                  *((volatile  uint8_t *)(0x42710094UL))
#define bFM_MFS8_CSIO_ESCR_L3                     *((volatile  uint8_t *)(0x42710098UL))
#define bFM4_MFS8_CSIO_ESCR_L3                    *((volatile  uint8_t *)(0x42710098UL))
#define bFM_MFS8_CSIO_ESCR_SOP                    *((volatile  uint8_t *)(0x4271009CUL))
#define bFM4_MFS8_CSIO_ESCR_SOP                   *((volatile  uint8_t *)(0x4271009CUL))

#define bFM_MFS8_CSIO_FCR_FE1                     *((volatile  uint8_t *)(0x42710280UL))
#define bFM4_MFS8_CSIO_FCR_FE1                    *((volatile  uint8_t *)(0x42710280UL))
#define bFM_MFS8_CSIO_FCR_FE2                     *((volatile  uint8_t *)(0x42710284UL))
#define bFM4_MFS8_CSIO_FCR_FE2                    *((volatile  uint8_t *)(0x42710284UL))
#define bFM_MFS8_CSIO_FCR_FCL1                    *((volatile  uint8_t *)(0x42710288UL))
#define bFM4_MFS8_CSIO_FCR_FCL1                   *((volatile  uint8_t *)(0x42710288UL))
#define bFM_MFS8_CSIO_FCR_FCL2                    *((volatile  uint8_t *)(0x4271028CUL))
#define bFM4_MFS8_CSIO_FCR_FCL2                   *((volatile  uint8_t *)(0x4271028CUL))
#define bFM_MFS8_CSIO_FCR_FSET                    *((volatile  uint8_t *)(0x42710290UL))
#define bFM4_MFS8_CSIO_FCR_FSET                   *((volatile  uint8_t *)(0x42710290UL))
#define bFM_MFS8_CSIO_FCR_FLD                     *((volatile  uint8_t *)(0x42710294UL))
#define bFM4_MFS8_CSIO_FCR_FLD                    *((volatile  uint8_t *)(0x42710294UL))
#define bFM_MFS8_CSIO_FCR_FLST                    *((volatile  uint8_t *)(0x42710298UL))
#define bFM4_MFS8_CSIO_FCR_FLST                   *((volatile  uint8_t *)(0x42710298UL))
#define bFM_MFS8_CSIO_FCR_FSEL                    *((volatile  uint8_t *)(0x427102A0UL))
#define bFM4_MFS8_CSIO_FCR_FSEL                   *((volatile  uint8_t *)(0x427102A0UL))
#define bFM_MFS8_CSIO_FCR_FTIE                    *((volatile  uint8_t *)(0x427102A4UL))
#define bFM4_MFS8_CSIO_FCR_FTIE                   *((volatile  uint8_t *)(0x427102A4UL))
#define bFM_MFS8_CSIO_FCR_FDRQ                    *((volatile  uint8_t *)(0x427102A8UL))
#define bFM4_MFS8_CSIO_FCR_FDRQ                   *((volatile  uint8_t *)(0x427102A8UL))
#define bFM_MFS8_CSIO_FCR_FRIIE                   *((volatile  uint8_t *)(0x427102ACUL))
#define bFM4_MFS8_CSIO_FCR_FRIIE                  *((volatile  uint8_t *)(0x427102ACUL))
#define bFM_MFS8_CSIO_FCR_FLSTE                   *((volatile  uint8_t *)(0x427102B0UL))
#define bFM4_MFS8_CSIO_FCR_FLSTE                  *((volatile  uint8_t *)(0x427102B0UL))

#define bFM_MFS8_CSIO_SACSR_TMRE                  *((volatile  uint8_t *)(0x42710480UL))
#define bFM4_MFS8_CSIO_SACSR_TMRE                 *((volatile  uint8_t *)(0x42710480UL))
#define bFM_MFS8_CSIO_SACSR_TSYNE                 *((volatile  uint8_t *)(0x42710498UL))
#define bFM4_MFS8_CSIO_SACSR_TSYNE                *((volatile  uint8_t *)(0x42710498UL))
#define bFM_MFS8_CSIO_SACSR_TINTE                 *((volatile  uint8_t *)(0x4271049CUL))
#define bFM4_MFS8_CSIO_SACSR_TINTE                *((volatile  uint8_t *)(0x4271049CUL))
#define bFM_MFS8_CSIO_SACSR_TINT                  *((volatile  uint8_t *)(0x427104A0UL))
#define bFM4_MFS8_CSIO_SACSR_TINT                 *((volatile  uint8_t *)(0x427104A0UL))
#define bFM_MFS8_CSIO_SACSR_CSE                   *((volatile  uint8_t *)(0x427104ACUL))
#define bFM4_MFS8_CSIO_SACSR_CSE                  *((volatile  uint8_t *)(0x427104ACUL))
#define bFM_MFS8_CSIO_SACSR_CSEIE                 *((volatile  uint8_t *)(0x427104B0UL))
#define bFM4_MFS8_CSIO_SACSR_CSEIE                *((volatile  uint8_t *)(0x427104B0UL))
#define bFM_MFS8_CSIO_SACSR_TBEEN                 *((volatile  uint8_t *)(0x427104B4UL))
#define bFM4_MFS8_CSIO_SACSR_TBEEN                *((volatile  uint8_t *)(0x427104B4UL))

#define bFM_MFS8_CSIO_SCR_TXE                     *((volatile  uint8_t *)(0x42710020UL))
#define bFM4_MFS8_CSIO_SCR_TXE                    *((volatile  uint8_t *)(0x42710020UL))
#define bFM_MFS8_CSIO_SCR_RXE                     *((volatile  uint8_t *)(0x42710024UL))
#define bFM4_MFS8_CSIO_SCR_RXE                    *((volatile  uint8_t *)(0x42710024UL))
#define bFM_MFS8_CSIO_SCR_TBIE                    *((volatile  uint8_t *)(0x42710028UL))
#define bFM4_MFS8_CSIO_SCR_TBIE                   *((volatile  uint8_t *)(0x42710028UL))
#define bFM_MFS8_CSIO_SCR_TIE                     *((volatile  uint8_t *)(0x4271002CUL))
#define bFM4_MFS8_CSIO_SCR_TIE                    *((volatile  uint8_t *)(0x4271002CUL))
#define bFM_MFS8_CSIO_SCR_RIE                     *((volatile  uint8_t *)(0x42710030UL))
#define bFM4_MFS8_CSIO_SCR_RIE                    *((volatile  uint8_t *)(0x42710030UL))
#define bFM_MFS8_CSIO_SCR_SPI                     *((volatile  uint8_t *)(0x42710034UL))
#define bFM4_MFS8_CSIO_SCR_SPI                    *((volatile  uint8_t *)(0x42710034UL))
#define bFM_MFS8_CSIO_SCR_MS                      *((volatile  uint8_t *)(0x42710038UL))
#define bFM4_MFS8_CSIO_SCR_MS                     *((volatile  uint8_t *)(0x42710038UL))
#define bFM_MFS8_CSIO_SCR_UPCL                    *((volatile  uint8_t *)(0x4271003CUL))
#define bFM4_MFS8_CSIO_SCR_UPCL                   *((volatile  uint8_t *)(0x4271003CUL))

#define bFM_MFS8_CSIO_SCSCR_CSOE                  *((volatile  uint8_t *)(0x42710600UL))
#define bFM4_MFS8_CSIO_SCSCR_CSOE                 *((volatile  uint8_t *)(0x42710600UL))
#define bFM_MFS8_CSIO_SCSCR_CSEN0                 *((volatile  uint8_t *)(0x42710604UL))
#define bFM4_MFS8_CSIO_SCSCR_CSEN0                *((volatile  uint8_t *)(0x42710604UL))
#define bFM_MFS8_CSIO_SCSCR_CSEN1                 *((volatile  uint8_t *)(0x42710608UL))
#define bFM4_MFS8_CSIO_SCSCR_CSEN1                *((volatile  uint8_t *)(0x42710608UL))
#define bFM_MFS8_CSIO_SCSCR_CSEN2                 *((volatile  uint8_t *)(0x4271060CUL))
#define bFM4_MFS8_CSIO_SCSCR_CSEN2                *((volatile  uint8_t *)(0x4271060CUL))
#define bFM_MFS8_CSIO_SCSCR_CSEN3                 *((volatile  uint8_t *)(0x42710610UL))
#define bFM4_MFS8_CSIO_SCSCR_CSEN3                *((volatile  uint8_t *)(0x42710610UL))
#define bFM_MFS8_CSIO_SCSCR_CSLVL                 *((volatile  uint8_t *)(0x42710614UL))
#define bFM4_MFS8_CSIO_SCSCR_CSLVL                *((volatile  uint8_t *)(0x42710614UL))
#define bFM_MFS8_CSIO_SCSCR_SCAM                  *((volatile  uint8_t *)(0x42710624UL))
#define bFM4_MFS8_CSIO_SCSCR_SCAM                 *((volatile  uint8_t *)(0x42710624UL))

