mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2g2xh/common/s6e2g2xh.h
#define bFM_MFS9_UART_SMR_SOE                     *((volatile  uint8_t *)(0x42712000UL))
#define bFM4_MFS9_UART_SMR_SOE                    *((volatile  uint8_t *)(0x42712000UL))
#define bFM_MFS9_UART_SMR_BDS                     *((volatile  uint8_t *)(0x42712008UL))
#define bFM4_MFS9_UART_SMR_BDS                    *((volatile  uint8_t *)(0x42712008UL))
#define bFM_MFS9_UART_SMR_SBL                     *((volatile  uint8_t *)(0x4271200CUL))
#define bFM4_MFS9_UART_SMR_SBL                    *((volatile  uint8_t *)(0x4271200CUL))

#define bFM_MFS9_UART_SSR_TBI                     *((volatile  uint8_t *)(0x427120A0UL))
#define bFM4_MFS9_UART_SSR_TBI                    *((volatile  uint8_t *)(0x427120A0UL))
#define bFM_MFS9_UART_SSR_TDRE                    *((volatile  uint8_t *)(0x427120A4UL))
#define bFM4_MFS9_UART_SSR_TDRE                   *((volatile  uint8_t *)(0x427120A4UL))
#define bFM_MFS9_UART_SSR_RDRF                    *((volatile  uint8_t *)(0x427120A8UL))
#define bFM4_MFS9_UART_SSR_RDRF                   *((volatile  uint8_t *)(0x427120A8UL))
#define bFM_MFS9_UART_SSR_ORE                     *((volatile  uint8_t *)(0x427120ACUL))
#define bFM4_MFS9_UART_SSR_ORE                    *((volatile  uint8_t *)(0x427120ACUL))
#define bFM_MFS9_UART_SSR_FRE                     *((volatile  uint8_t *)(0x427120B0UL))
#define bFM4_MFS9_UART_SSR_FRE                    *((volatile  uint8_t *)(0x427120B0UL))
#define bFM_MFS9_UART_SSR_PE                      *((volatile  uint8_t *)(0x427120B4UL))
#define bFM4_MFS9_UART_SSR_PE                     *((volatile  uint8_t *)(0x427120B4UL))
#define bFM_MFS9_UART_SSR_REC                     *((volatile  uint8_t *)(0x427120BCUL))
#define bFM4_MFS9_UART_SSR_REC                    *((volatile  uint8_t *)(0x427120BCUL))


/*******************************************************************************
* MFSI2S Registers MFSI2SA
*   Bitband Section
*******************************************************************************/
#define bFM_MFSI2SA_CNTLREG_FRAML                 *((volatile  uint8_t *)(0x42794000UL))
#define bFM4_MFSI2SA_CNTLREG_FRAML                *((volatile  uint8_t *)(0x42794000UL))
#define bFM_MFSI2SA_CNTLREG_I2SMOD                *((volatile  uint8_t *)(0x4279400CUL))
#define bFM4_MFSI2SA_CNTLREG_I2SMOD               *((volatile  uint8_t *)(0x4279400CUL))
#define bFM_MFSI2SA_CNTLREG_FSPL                  *((volatile  uint8_t *)(0x42794010UL))
#define bFM4_MFSI2SA_CNTLREG_FSPL                 *((volatile  uint8_t *)(0x42794010UL))
#define bFM_MFSI2SA_CNTLREG_I2SEN                 *((volatile  uint8_t *)(0x42794014UL))
#define bFM4_MFSI2SA_CNTLREG_I2SEN                *((volatile  uint8_t *)(0x42794014UL))
#define bFM_MFSI2SA_CNTLREG_CKOE                  *((volatile  uint8_t *)(0x42794018UL))
#define bFM4_MFSI2SA_CNTLREG_CKOE                 *((volatile  uint8_t *)(0x42794018UL))
#define bFM_MFSI2SA_CNTLREG_MSKB                  *((volatile  uint8_t *)(0x42794020UL))
#define bFM4_MFSI2SA_CNTLREG_MSKB                 *((volatile  uint8_t *)(0x42794020UL))
#define bFM_MFSI2SA_CNTLREG_I2SRUN                *((volatile  uint8_t *)(0x42794028UL))
#define bFM4_MFSI2SA_CNTLREG_I2SRUN               *((volatile  uint8_t *)(0x42794028UL))

#define bFM_MFSI2SA_I2SCLK_MCKOE                  *((volatile  uint8_t *)(0x427940B8UL))
#define bFM4_MFSI2SA_I2SCLK_MCKOE                 *((volatile  uint8_t *)(0x427940B8UL))
#define bFM_MFSI2SA_I2SCLK_MCKIE                  *((volatile  uint8_t *)(0x427940BCUL))
#define bFM4_MFSI2SA_I2SCLK_MCKIE                 *((volatile  uint8_t *)(0x427940BCUL))

#define bFM_MFSI2SA_I2SST_CKSTP                   *((volatile  uint8_t *)(0x42794120UL))
#define bFM4_MFSI2SA_I2SST_CKSTP                  *((volatile  uint8_t *)(0x42794120UL))
#define bFM_MFSI2SA_I2SST_BUSY                    *((volatile  uint8_t *)(0x42794124UL))
#define bFM4_MFSI2SA_I2SST_BUSY                   *((volatile  uint8_t *)(0x42794124UL))


/*******************************************************************************
* MFT_PPG Registers MFT_PPG
*   Bitband Section
*******************************************************************************/
#define bFM_MFT_PPG_GATEC0_EDGE0                  *((volatile  uint8_t *)(0x42484300UL))
#define bFM4_MFT_PPG_GATEC0_EDGE0                 *((volatile  uint8_t *)(0x42484300UL))
#define bFM_MFT_PPG_GATEC0_STRG0                  *((volatile  uint8_t *)(0x42484304UL))
#define bFM4_MFT_PPG_GATEC0_STRG0                 *((volatile  uint8_t *)(0x42484304UL))
#define bFM_MFT_PPG_GATEC0_EDGE2                  *((volatile  uint8_t *)(0x42484310UL))
#define bFM4_MFT_PPG_GATEC0_EDGE2                 *((volatile  uint8_t *)(0x42484310UL))
#define bFM_MFT_PPG_GATEC0_STRG2                  *((volatile  uint8_t *)(0x42484314UL))
#define bFM4_MFT_PPG_GATEC0_STRG2                 *((volatile  uint8_t *)(0x42484314UL))

#define bFM_MFT_PPG_GATEC12_EDGE12                *((volatile  uint8_t *)(0x42485B00UL))
#define bFM4_MFT_PPG_GATEC12_EDGE12               *((volatile  uint8_t *)(0x42485B00UL))
#define bFM_MFT_PPG_GATEC12_STRG12                *((volatile  uint8_t *)(0x42485B04UL))
#define bFM4_MFT_PPG_GATEC12_STRG12               *((volatile  uint8_t *)(0x42485B04UL))
#define bFM_MFT_PPG_GATEC12_EDGE14                *((volatile  uint8_t *)(0x42485B10UL))
#define bFM4_MFT_PPG_GATEC12_EDGE14               *((volatile  uint8_t *)(0x42485B10UL))
#define bFM_MFT_PPG_GATEC12_STRG14                *((volatile  uint8_t *)(0x42485B14UL))
#define bFM4_MFT_PPG_GATEC12_STRG14               *((volatile  uint8_t *)(0x42485B14UL))

#define bFM_MFT_PPG_GATEC16_EDGE16                *((volatile  uint8_t *)(0x42486300UL))
#define bFM4_MFT_PPG_GATEC16_EDGE16               *((volatile  uint8_t *)(0x42486300UL))
#define bFM_MFT_PPG_GATEC16_STRG16                *((volatile  uint8_t *)(0x42486304UL))
#define bFM4_MFT_PPG_GATEC16_STRG16               *((volatile  uint8_t *)(0x42486304UL))
#define bFM_MFT_PPG_GATEC16_EDGE18                *((volatile  uint8_t *)(0x42486310UL))
#define bFM4_MFT_PPG_GATEC16_EDGE18               *((volatile  uint8_t *)(0x42486310UL))
#define bFM_MFT_PPG_GATEC16_STRG18                *((volatile  uint8_t *)(0x42486314UL))
#define bFM4_MFT_PPG_GATEC16_STRG18               *((volatile  uint8_t *)(0x42486314UL))

#define bFM_MFT_PPG_GATEC20_EDGE20                *((volatile  uint8_t *)(0x42486B00UL))
#define bFM4_MFT_PPG_GATEC20_EDGE20               *((volatile  uint8_t *)(0x42486B00UL))
#define bFM_MFT_PPG_GATEC20_STRG20                *((volatile  uint8_t *)(0x42486B04UL))
#define bFM4_MFT_PPG_GATEC20_STRG20               *((volatile  uint8_t *)(0x42486B04UL))
#define bFM_MFT_PPG_GATEC20_EDGE22                *((volatile  uint8_t *)(0x42486B10UL))
#define bFM4_MFT_PPG_GATEC20_EDGE22               *((volatile  uint8_t *)(0x42486B10UL))
#define bFM_MFT_PPG_GATEC20_STRG22                *((volatile  uint8_t *)(0x42486B14UL))
#define bFM4_MFT_PPG_GATEC20_STRG22               *((volatile  uint8_t *)(0x42486B14UL))

