mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2g2xh/common/s6e2g2xh.h
/*******************************************************************************
* QPRC_NF Registers QPRC1_NF
*   Bitband Section
*******************************************************************************/
#define bFM_QPRC1_NF_NFCTLA_AINLV                 *((volatile  uint8_t *)(0x424C2210UL))
#define bFM4_QPRC1_NF_NFCTLA_AINLV                *((volatile  uint8_t *)(0x424C2210UL))
#define bFM_QPRC1_NF_NFCTLA_AINMD                 *((volatile  uint8_t *)(0x424C2214UL))
#define bFM4_QPRC1_NF_NFCTLA_AINMD                *((volatile  uint8_t *)(0x424C2214UL))

#define bFM_QPRC1_NF_NFCTLB_BINLV                 *((volatile  uint8_t *)(0x424C2290UL))
#define bFM4_QPRC1_NF_NFCTLB_BINLV                *((volatile  uint8_t *)(0x424C2290UL))
#define bFM_QPRC1_NF_NFCTLB_BINMD                 *((volatile  uint8_t *)(0x424C2294UL))
#define bFM4_QPRC1_NF_NFCTLB_BINMD                *((volatile  uint8_t *)(0x424C2294UL))

#define bFM_QPRC1_NF_NFCTLZ_ZINLV                 *((volatile  uint8_t *)(0x424C2310UL))
#define bFM4_QPRC1_NF_NFCTLZ_ZINLV                *((volatile  uint8_t *)(0x424C2310UL))
#define bFM_QPRC1_NF_NFCTLZ_ZINMD                 *((volatile  uint8_t *)(0x424C2314UL))
#define bFM4_QPRC1_NF_NFCTLZ_ZINMD                *((volatile  uint8_t *)(0x424C2314UL))


/*******************************************************************************
* QPRC Registers QPRC2
*   Bitband Section
*******************************************************************************/
#define bFM_QPRC2_QCR_PSTP                        *((volatile  uint8_t *)(0x424C1310UL))
#define bFM4_QPRC2_QCR_PSTP                       *((volatile  uint8_t *)(0x424C1310UL))
#define bFM_QPRC2_QCR_CGSC                        *((volatile  uint8_t *)(0x424C1314UL))
#define bFM4_QPRC2_QCR_CGSC                       *((volatile  uint8_t *)(0x424C1314UL))
#define bFM_QPRC2_QCR_RSEL                        *((volatile  uint8_t *)(0x424C1318UL))
#define bFM4_QPRC2_QCR_RSEL                       *((volatile  uint8_t *)(0x424C1318UL))
#define bFM_QPRC2_QCR_SWAP                        *((volatile  uint8_t *)(0x424C131CUL))
#define bFM4_QPRC2_QCR_SWAP                       *((volatile  uint8_t *)(0x424C131CUL))

#define bFM_QPRC2_QECR_ORNGMD                     *((volatile  uint8_t *)(0x424C1380UL))
#define bFM4_QPRC2_QECR_ORNGMD                    *((volatile  uint8_t *)(0x424C1380UL))
#define bFM_QPRC2_QECR_ORNGF                      *((volatile  uint8_t *)(0x424C1384UL))
#define bFM4_QPRC2_QECR_ORNGF                     *((volatile  uint8_t *)(0x424C1384UL))
#define bFM_QPRC2_QECR_ORNGIE                     *((volatile  uint8_t *)(0x424C1388UL))
#define bFM4_QPRC2_QECR_ORNGIE                    *((volatile  uint8_t *)(0x424C1388UL))
#define bFM_QPRC2_QECR_PEC                        *((volatile  uint8_t *)(0x424C138CUL))
#define bFM4_QPRC2_QECR_PEC                       *((volatile  uint8_t *)(0x424C138CUL))

#define bFM_QPRC2_QICRH_CDCIE                     *((volatile  uint8_t *)(0x424C12A0UL))
#define bFM4_QPRC2_QICRH_CDCIE                    *((volatile  uint8_t *)(0x424C12A0UL))
#define bFM_QPRC2_QICRH_CDCF                      *((volatile  uint8_t *)(0x424C12A4UL))
#define bFM4_QPRC2_QICRH_CDCF                     *((volatile  uint8_t *)(0x424C12A4UL))
#define bFM_QPRC2_QICRH_DIRPC                     *((volatile  uint8_t *)(0x424C12A8UL))
#define bFM4_QPRC2_QICRH_DIRPC                    *((volatile  uint8_t *)(0x424C12A8UL))
#define bFM_QPRC2_QICRH_DIROU                     *((volatile  uint8_t *)(0x424C12ACUL))
#define bFM4_QPRC2_QICRH_DIROU                    *((volatile  uint8_t *)(0x424C12ACUL))
#define bFM_QPRC2_QICRH_QPCNRCMIE                 *((volatile  uint8_t *)(0x424C12B0UL))
#define bFM4_QPRC2_QICRH_QPCNRCMIE                *((volatile  uint8_t *)(0x424C12B0UL))
#define bFM_QPRC2_QICRH_QPCNRCMF                  *((volatile  uint8_t *)(0x424C12B4UL))
#define bFM4_QPRC2_QICRH_QPCNRCMF                 *((volatile  uint8_t *)(0x424C12B4UL))

#define bFM_QPRC2_QICRL_QPCMIE                    *((volatile  uint8_t *)(0x424C1280UL))
#define bFM4_QPRC2_QICRL_QPCMIE                   *((volatile  uint8_t *)(0x424C1280UL))
#define bFM_QPRC2_QICRL_QPCMF                     *((volatile  uint8_t *)(0x424C1284UL))
#define bFM4_QPRC2_QICRL_QPCMF                    *((volatile  uint8_t *)(0x424C1284UL))
#define bFM_QPRC2_QICRL_QPRCMIE                   *((volatile  uint8_t *)(0x424C1288UL))
#define bFM4_QPRC2_QICRL_QPRCMIE                  *((volatile  uint8_t *)(0x424C1288UL))
#define bFM_QPRC2_QICRL_QPRCMF                    *((volatile  uint8_t *)(0x424C128CUL))
#define bFM4_QPRC2_QICRL_QPRCMF                   *((volatile  uint8_t *)(0x424C128CUL))
#define bFM_QPRC2_QICRL_OUZIE                     *((volatile  uint8_t *)(0x424C1290UL))
#define bFM4_QPRC2_QICRL_OUZIE                    *((volatile  uint8_t *)(0x424C1290UL))
#define bFM_QPRC2_QICRL_UFDF                      *((volatile  uint8_t *)(0x424C1294UL))
#define bFM4_QPRC2_QICRL_UFDF                     *((volatile  uint8_t *)(0x424C1294UL))
#define bFM_QPRC2_QICRL_OFDF                      *((volatile  uint8_t *)(0x424C1298UL))
#define bFM4_QPRC2_QICRL_OFDF                     *((volatile  uint8_t *)(0x424C1298UL))
#define bFM_QPRC2_QICRL_ZIIF                      *((volatile  uint8_t *)(0x424C129CUL))
#define bFM4_QPRC2_QICRL_ZIIF                     *((volatile  uint8_t *)(0x424C129CUL))


/*******************************************************************************
* QPRC_NF Registers QPRC2_NF
*   Bitband Section
*******************************************************************************/
#define bFM_QPRC2_NF_NFCTLA_AINLV                 *((volatile  uint8_t *)(0x424C2410UL))
#define bFM4_QPRC2_NF_NFCTLA_AINLV                *((volatile  uint8_t *)(0x424C2410UL))
#define bFM_QPRC2_NF_NFCTLA_AINMD                 *((volatile  uint8_t *)(0x424C2414UL))
#define bFM4_QPRC2_NF_NFCTLA_AINMD                *((volatile  uint8_t *)(0x424C2414UL))

#define bFM_QPRC2_NF_NFCTLB_BINLV                 *((volatile  uint8_t *)(0x424C2490UL))
#define bFM4_QPRC2_NF_NFCTLB_BINLV                *((volatile  uint8_t *)(0x424C2490UL))
#define bFM_QPRC2_NF_NFCTLB_BINMD                 *((volatile  uint8_t *)(0x424C2494UL))
#define bFM4_QPRC2_NF_NFCTLB_BINMD                *((volatile  uint8_t *)(0x424C2494UL))

#define bFM_QPRC2_NF_NFCTLZ_ZINLV                 *((volatile  uint8_t *)(0x424C2510UL))
#define bFM4_QPRC2_NF_NFCTLZ_ZINLV                *((volatile  uint8_t *)(0x424C2510UL))
#define bFM_QPRC2_NF_NFCTLZ_ZINMD                 *((volatile  uint8_t *)(0x424C2514UL))
#define bFM4_QPRC2_NF_NFCTLZ_ZINMD                *((volatile  uint8_t *)(0x424C2514UL))


